In [1]:
import pandas as pd

In [22]:
pd.__version__

'2.3.3'

In [23]:
sales=pd.Series((1,5,6,11,7,2,3,4))

In [24]:
sales

0     1
1     5
2     6
3    11
4     7
5     2
6     3
7     4
dtype: int64

In [25]:
sales[0]

np.int64(1)

In [26]:
sales[0:2]

0    1
1    5
dtype: int64

In [27]:
sales.index

RangeIndex(start=0, stop=8, step=1)

In [28]:
  sales.values

array([ 1,  5,  6, 11,  7,  2,  3,  4])

In [29]:
sales.dtype

dtype('int64')

In [30]:
sales.tail(1)

7    4
dtype: int64

In [31]:
 sales.sort_values()

0     1
5     2
6     3
7     4
1     5
2     6
4     7
3    11
dtype: int64

In [32]:
sales.count()

np.int64(8)

In [33]:
sales.notnull()

0    True
1    True
2    True
3    True
4    True
5    True
6    True
7    True
dtype: bool

In [34]:
sales+1

0     2
1     6
2     7
3    12
4     8
5     3
6     4
7     5
dtype: int64

In [35]:
sales+5

0     6
1    10
2    11
3    16
4    12
5     7
6     8
7     9
dtype: int64

In [36]:
sales_mis=pd.Series([1,None,19,33])

In [37]:
sales_mis.notnull()

0     True
1    False
2     True
3     True
dtype: bool

In [38]:
sales_mis=sales_mis.fillna(0)

In [40]:
data=pd.DataFrame(data={
    'Name':["SHAHID","AQUIB"],'Lemonades':[2,4]
},index=list('ab'))

In [41]:
data

     Name  Lemonades
a  SHAHID          2
b   AQUIB          4

In [42]:
s1=pd.Series(data=[1,2,3,4,5])
s2=pd.Series(data=[10,20,30,40,50])

In [43]:
s2=pd.Series(data=[10,20,30,40,50])

In [44]:
df=pd.DataFrame(data={'C1':s1,'C2':s2})

In [45]:
df

   C1  C2
0   1  10
1   2  20
2   3  30
3   4  40
4   5  50

In [46]:
 s1.shape

(5,)

In [47]:
data.shape

(2, 2)

In [ ]:
data.columns

# ACCESSING DATA

In [48]:
df.loc[1,'C1']

np.int64(2)

In [49]:
data

     Name  Lemonades
a  SHAHID          2
b   AQUIB          4

In [50]:
s1=pd.Series(data=[1,2,3,4,5])
s2=pd.Series(data=[10,20,30,40,50])

In [51]:
dataf=pd.DataFrame(data={'C1':s1,'C2':s2})

In [52]:
dataf

   C1  C2
0   1  10
1   2  20
2   3  30
3   4  40
4   5  50

In [53]:
dataf.iloc[2,0]

np.int64(3)

In [54]:
dataf.tail(2)

   C1  C2
3   4  40
4   5  50

In [55]:
dataf.count()

C1    5
C2    5
dtype: int64

In [56]:
dataf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   C1      5 non-null      int64
 1   C2      5 non-null      int64
dtypes: int64(2)
memory usage: 212.0 bytes

In [57]:
dataf.describe()

             C1         C2
count  5.000000   5.000000
mean   3.000000  30.000000
std    1.581139  15.811388
min    1.000000  10.000000
25%    2.000000  20.000000
50%    3.000000  30.000000
75%    4.000000  40.000000
max    5.000000  50.000000

In [58]:
dataf[dataf['C1']!=3]

   C1  C2
0   1  10
1   2  20
3   4  40
4   5  50

In [59]:
df

   C1  C2
0   1  10
1   2  20
2   3  30
3   4  40
4   5  50

In [60]:
df.loc[df['C1']==3,'C1']=500

In [61]:
df

    C1  C2
0    1  10
1    2  20
2  500  30
3    4  40
4    5  50

In [62]:
df=df.rename(columns={'C1':'COLUMN1'})

In [63]:
df.rename(columns={'C2':'COLUMN2'},inplace='True')

In [64]:
df

   COLUMN1  COLUMN2
0        1       10
1        2       20
2      500       30
3        4       40
4        5       50

In [65]:
df['tips']=['a','b','c','d','e']

In [66]:
df

   COLUMN1  COLUMN2 tips
0        1       10    a
1        2       20    b
2      500       30    c
3        4       40    d
4        5       50    e

In [67]:
df.set_index('tips',inplace=True)

In [68]:
df

      COLUMN1  COLUMN2
tips
a           1       10
b           2       20
c         500       30
d           4       40
e           5       50

In [69]:
df.iloc[4,1]

np.int64(50)

In [70]:
df

      COLUMN1  COLUMN2
tips
a           1       10
b           2       20
c         500       30
d           4       40
e           5       50

In [71]:
df.reset_index(inplace=True)

In [72]:
df

  tips  COLUMN1  COLUMN2
0    a        1       10
1    b        2       20
2    c      500       30
3    d        4       40
4    e        5       50

In [73]:
multi_data=pd.DataFrame({
'PARK':['A','B','A','B'],
    'Name':['Anna','Ben','Chris','Disy'],
    'Lemonades':[1,3,2,5]
}).set_index(['PARK','Name'])

In [74]:
multi_data

            Lemonades
PARK Name
A    Anna           1
B    Ben            3
A    Chris          2
B    Disy           5

In [75]:
multi_data[multi_data['Lemonades']==2]

            Lemonades
PARK Name
A    Chris          2

In [76]:
multi_data.query('Lemonades>2')

           Lemonades
PARK Name
B    Ben           3
     Disy          5

# Working with data

In [77]:
multi_data.to_csv('lemons.csv')

In [78]:
data=pd.read_csv('lemons.csv')

In [79]:
data

  PARK   Name  Lemonades
0    A   Anna          1
1    B    Ben          3
2    A  Chris          2
3    B   Disy          5

In [88]:
import numpy as np
dict={'x':[1,2,5],'y':np.array([10,20,30])}

In [89]:
dict

{'x': [1, 2, 5], 'y': array([10, 20, 30])}

In [90]:
pd.DataFrame(dict)

   x   y
0  1  10
1  2  20
2  5  30

In [91]:
list=[[1,2,100],[2,4,100],[3,8,100]]

In [95]:
pd.DataFrame(nar,columns=['x','y','z'])

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100

In [94]:
nar=np.array([[1,2,100],[2,4,100],[3,8,100]])

In [ ]:
sales =pd.Series([2,None,5])

In [ ]:
sales

In [ ]:
sales.dropna()

In [ ]:
sales.fillna(7)

In [ ]:
sales.fillna(sales.var())

In [ ]:
  data

In [ ]:
df

In [ ]:
df['test']=[1,1,4,4,3]

In [ ]:
df

In [ ]:
df.drop_duplicates()

In [ ]:
df.replace(500,1000)

In [ ]:
df['COLUMN2']=df['COLUMN2'].astype(float)

In [ ]:
df

In [ ]:
del df['COLUMN1']

In [ ]:
df

In [ ]:
df.columns=['tips','COLUMN1','test','COLUMN1',inplace=True]

In [ ]:
df.rename(columns={'COLUMN2':'COLUMN1','C1':'COLUMN1'},inplace=True)

In [ ]:
df

In [ ]:
df['test']=df['test'].astype(float)

In [ ]:
df

In [ ]:
df

In [ ]:
df['OPERATORS']=df['OPERATORS'].str.upper()

In [ ]:
df

# DATA AGGREGATION AND GROUPING

In [197]:
 s1=pd.Series(data=['A','F','A','B','C'])

In [198]:
s2=pd.Series(data=[10,20,30,40,50])

In [199]:
data=pd.DataFrame({'Name':s1,'Lemonades':s2})

In [97]:
data

  PARK   Name  Lemonades
0    A   Anna          1
1    B    Ben          3
2    A  Chris          2
3    B   Disy          5

In [100]:
grouped=data.groupby('Name')
grouped.sum()

      PARK  Lemonades
Name
Anna     A          1
Ben      B          3
Chris    A          2
Disy     B          5

In [ ]:
grouped['Lemonades'].mean()

In [96]:
dataf

   C1  C2
0   1  10
1   2  20
2   3  30
3   4  40
4   5  50

In [118]:
group=data.groupby('PARK').agg({
    'Name':','.join,
    'Lemonades':'sum'
})

In [119]:
print(group)

            Name  Lemonades
PARK
A     Anna,Chris          3
B       Ben,Disy          8

group.mean()

In [115]:
group['Lemonades'].sum()

PARK
A    3
B    8
Name: Lemonades, dtype: int64

In [120]:
 s1=pd.Series(data=['A','B','A','B','C'])

In [122]:
s2=pd.Series(data=[10,20,30,40,50])

In [123]:
data=pd.DataFrame({'Name':s1,'Lemonades':s2})

day=ta

In [139]:
data['something']=['alpha','beta','Gamma','Delta','Lambda']
data

  Name  Lemonades something
0    A         10     alpha
1    B         20      beta
2    A         30     Gamma
3    B         40     Delta
4    C         50    Lambda

In [133]:
grouped=data.groupby('Name')
grouped.mean()

      Lemonades
Name
A          20.0
B          30.0
C          50.0

In [127]:
grouped

# Pivot table and cross tab

In [141]:
data.pivot_table(values="Lemonades",index="Name")
data

  Name  Lemonades something
0    A         10     alpha
1    B         20      beta
2    A         30     Gamma
3    B         40     Delta
4    C         50    Lambda

In [142]:
pd.crosstab([data['Name'],data['something']],data['Lemonades'])

Lemonades       10  20  30  40  50
Name something
A    Gamma       0   0   1   0   0
     alpha       1   0   0   0   0
B    Delta       0   0   0   1   0
     beta        0   1   0   0   0
C    Lambda      0   0   0   0   1

In [196]:
data2=pd.DataFrame({"Name":["C","C","B","A","E"],"Lemon":[20,12,33,41,10]})

In [189]:
data2

  Name  Lemon
0    C     20
1    C     12
2    B     33
3    A     41
4    A     10

In [148]:
data

  Name  Lemonades something
0    A         10     alpha
1    B         20      beta
2    A         30     Gamma
3    B         40     Delta
4    C         50    Lambda

In [152]:
pd.concat([data,data2])

  Name  Lemonades something  Lemon
0    A       10.0     alpha    NaN
1    B       20.0      beta    NaN
2    A       30.0     Gamma    NaN
3    B       40.0     Delta    NaN
4    C       50.0    Lambda    NaN
0    c        NaN       phi   20.0
1    C        NaN     theta   12.0
2    B        NaN        mu   33.0
3    A        NaN   epsilon   41.0
4    A        NaN      null   10.0

In [170]:
data

  Name  Lemonades
0    A         10
1    B         20
2    A         30
3    B         40
4    C         50

In [171]:
data2

  Name  Lemon something
0    C     20       phi
1    C     12     theta
2    B     33        mu
3    A     41   epsilon
4    A     10      null

In [172]:
pd.merge(data,data2,on='Name')

  Name  Lemonades  Lemon something
0    A         10     41   epsilon
1    A         10     10      null
2    B         20     33        mu
3    A         30     41   epsilon
4    A         30     10      null
5    B         40     33        mu
6    C         50     20       phi
7    C         50     12     theta

In [159]:
data

  Name  Lemonades something
0    A         10     alpha
1    B         20      beta
2    A         30     Gamma
3    B         40     Delta
4    C         50    Lambda

In [162]:
data2.drop(columns=['something'] ,inplace=True)

In [190]:
data

  Name  Lemonades
0    A         10
1    B         20
2    A         30
3    B         40
4    C         50

In [191]:
data2

  Name  Lemon
0    C     20
1    C     12
2    B     33
3    A     41
4    A     10

In [192]:
pd.merge(data,data2,on='Name')

  Name  Lemonades  Lemon
0    A         10     41
1    A         10     10
2    B         20     33
3    A         30     41
4    A         30     10
5    B         40     33
6    C         50     20
7    C         50     12

In [185]:
data

  Name  Lemonades
0    A         10
1    B         20
2    A         30
3    B         40
4    C         50

In [193]:
data2

  Name  Lemon
0    C     20
1    C     12
2    B     33
3    A     41
4    A     10

In [194]:
pd.merge(data,data2,on='Name')

  Name  Lemonades  Lemon
0    A         10     41
1    A         10     10
2    B         20     33
3    A         30     41
4    A         30     10
5    B         40     33
6    C         50     20
7    C         50     12

In [195]:
data.join(data2.set_index('Name'),on='Name')

  Name  Lemonades  Lemon
0    A         10     41
0    A         10     10
1    B         20     33
2    A         30     41
2    A         30     10
3    B         40     33
4    C         50     20
4    C         50     12

In [200]:
data

  Name  Lemonades
0    A         10
1    F         20
2    A         30
3    B         40
4    C         50

In [202]:
data2

  Name  Lemon
0    C     20
1    C     12
2    B     33
3    A     41
4    E     10

In [204]:
pd.merge(data,data2,on='Name')

  Name  Lemonades  Lemon
0    A         10     41
1    B         40     33
2    A         30     41
3    C         50     20
4    C         50     12

In [206]:
data

  Name  Lemonades
0    A         10
1    F         20
2    A         30
3    B         40
4    C         50

In [207]:
data2

  Name  Lemon
0    C     20
1    C     12
2    B     33
3    A     41
4    E     10

In [209]:
data.join(data2.set_index('Name'),on='Name')

  Name  Lemonades  Lemon
0    A         10   41.0
1    F         20    NaN
2    A         30   41.0
3    B         40   33.0
4    C         50   20.0
4    C         50   12.0

# Working with timeseries data

In [210]:
names=['Shahid','Kabir','David','Ishmael']

In [260]:
dates=pd.date_range(start='12-01-2025',end='12-25-2025').astype(str)

In [261]:
timedata=pd.DataFrame({
'Date':np.random.choice(dates,size=7),
    'Customer Name':np.random.choice(names,size=7),
    'Lemonades':np.random.randint(1,10,size=7)
})

In [262]:
timedata
timedata['Date'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 7 entries, 0 to 6
Series name: Date
Non-Null Count  Dtype
--------------  -----
7 non-null      object
dtypes: object(1)
memory usage: 188.0+ bytes

In [263]:
timedata

         Date Customer Name  Lemonades
0  2025-12-04        Shahid          9
1  2025-12-24       Ishmael          9
2  2025-12-12        Khalid          7
3  2025-12-02         David          6
4  2025-12-24         David          3
5  2025-12-06         Kabir          7
6  2025-12-03        Shahid          3

In [264]:
timedata['Date']=pd.to_datetime(timedata['Date'])

In [265]:
timedata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           7 non-null      datetime64[ns]
 1   Customer Name  7 non-null      object
 2   Lemonades      7 non-null      int64
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 300.0+ bytes

In [266]:
pd.to_datetime('2025-12-25')

Timestamp('2025-12-25 00:00:00')

In [267]:
timedata

        Date Customer Name  Lemonades
0 2025-12-04        Shahid          9
1 2025-12-24       Ishmael          9
2 2025-12-12        Khalid          7
3 2025-12-02         David          6
4 2025-12-24         David          3
5 2025-12-06         Kabir          7
6 2025-12-03        Shahid          3

# Resampling

weekly resampling

In [277]:
timedata.resample('YE',on='Date').agg({'Lemonades':'sum',
                                      'Customer Name':lambda x:','.join(x.unique())})

            Lemonades                      Customer Name
Date
2025-12-31         44  David,Shahid,Kabir,Khalid,Ishmael

# SHIFTING AND LAGGING

In [278]:
data

  Name  Lemonades
0    A         10
1    F         20
2    A         30
3    B         40
4    C         50

In [281]:
data['Previous Lemonades']=data['Lemonades'].shift(2)

In [282]:
data

  Name  Lemonades  Previous Lemonades
0    A         10                 NaN
1    F         20                 NaN
2    A         30                10.0
3    B         40                20.0
4    C         50                30.0

# ROLLING CALCULATION
simple moving Averages SMA

In [284]:
data['Rolling Average']=data['Lemonades'].rolling(window=2).mean()

In [285]:
data

  Name  Lemonades  Previous Lemonades  Rolling Average
0    A         10                 NaN              NaN
1    F         20                 NaN             15.0
2    A         30                10.0             25.0
3    B         40                20.0             35.0
4    C         50                30.0             45.0

In [2]:
sr=pd.Series(['humans','animals','angels','humans','angels','humans'])

In [3]:
counts=sr.value_counts()
print(counts)

humans     3
angels     2
animals    1
Name: count, dtype: int64

In [4]:
import numpy as np
import pandas as pd

# Create a 1D array of 12 elements
arr = np.arange(12)

# Reshape to 4 rows and 3 columns and convert to DataFrame
df = pd.DataFrame(arr.reshape(4, 3), columns=['A', 'B', 'C'])
print(df)

   A   B   C
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11